update README.md diagrams
